export const guideMarkdownSteps = [
  `
# Guide
Дотримуючись цих інструкцій, ви відкриєте для себе функціонал цього додатку.
## Планування
  * **Крок 1 - Створення середовища для планування:** Для прикладу планувати будемо вивчення Front-end розробки, для цього:
    * Нажміть "a" на клавіатурі (або кнопку +)
    * Введіть "План вивчення Front-end" у текстове поле
    * Нажміть Enter (або кнопку "+ Add")
    * Нажміть "L" на клавіатурі (або натисніть на створений елемент)
  * **Крок 2 - Процес планування:** План можна поділити грубо на цілі: html, css, js, git, react, tailwind. 
  Для кожної цілі створіть окремий елемент із відповідною назвою зберігаючи послідовність
  * **Крок 3 - Деталізація плану:** Для прикладу почнемо з виконання цілі "html",
  вивчати будемо по гайду з інтернету, там є така послідовність кроків: **"підготовка середовища розробки", 
  "основні теги", "побудова скелету сайту"** - нехай вони будуть підцілями цілі "html", для цього:
    * Перейдіть у середовище цілі "html", використовуйте клавіші "j" та "k", щоб вибрати його та нажміть "L" (Або клікніть на потрібну ціль)
    * Створіть для кожної під цілі елемент як у (крок 2)
  * **Крок 4 - Використання плану:** Допустім настало завтра і ви забули про всі підцілі, лише памятаєте про якийсь план
    * Перейдіть додому "Shift + h" (або нажміть на іконку дому зверху) і ви побачите той самий план, що створювали
    * Перейдіть у середовище "План вивчення Front-end", тепер ви побачите всі цілі, які потрібно виконати
    * Перша ціль "html" і буде тою, що потрібно виконати першою, також зверніть увагу на заповнену іконку, що означає, що у неї є щось всередині, тож перейшовши у середовище "html" ви зможете побачити всі підцілі
    * Наприклад першу підціль "Підготовка середовища розрокби" було виконано, одже її можна видалити, нажмість "Shift + d" або виберіть "Видалити" в меню елемента
`,
  `
## Зберігання та використання знань
Для прикладу зявляються різні ідеї,
`,
  `
## Імітуємо процес мислення
* Мислення
  * Є філосовська думка
    * Є твердження
      * Можна передбачити майбутнє, знаючи достатньо знань
      * Докази
        * Наприклад якщо точно вирахувати гравітацію, кут падіння, відстань до поверхні, то можна передбачити сторону випадіння кисті
        * Якщо я витягну пістолет то всі або піднімуть руки або заховаються при умові якщо кожен є неозброєним
    * з нього випливає суперечливе твердження
      * Одже якщо я знаю абсолютно все (до атома), то я можу передбачити майбутнє з високою точністю
      * В тому числі і нейрони в голові мого мислення, що змінюється залежно від знань про майбутнє
      * Тобто я передбачаю, що я знаю про передбачення що я передбачав передбачення і так нескінченно
    * Нова думка
      * Проблема у тому, що під для складного передбачування потрібен складніший мозок, що ускладнює передбачування його самого ж, що потребує ще складніший і тд.
  * Результат - памятаю контекст
`,
];
