export const guideMarkdownSteps = [
  `
## Не тримайте все в голові!
адже є ризик забути важливу ціль, ідею чи знання. Натомість одразу фіксуйте це у **strukt**:

**Як зберегти інформацію прямо зараз:**
  * ➕ Натисніть на **«+»** унизу екрану.
  * ✍️ Введіть у текстове поле дані, які потрібно запам'ятати.
  * ✅ Натисніть **«Додати»**.


**Спробуйте прямо зараз! Запишіть ці 5 прикладів, щоб вони завжди були під рукою:**
  * 🥫 **Побутовий лайфхак:** *«Щоб відкрити банку для закрутки, притисніть кришку з боків»*.
  * 🎂 **Важлива дата:** *«Д.Р. [ім'я] [дата народження]»*.
  * 📖 **Цитата або думка:** *«Цікава ідея для проєкту: [текст ідеї]»*.
  * 🛍️ **Список покупок:** *«Купити корм для кота та батарейки»*.
  * ✅ **Ціль:** *«Зробити дз з математики: ст. 12 до 12.11»*

**Як знайти потрібне за секунду:**
🔍 Вам достатньо пам'ятати про наявність, просто введіть у **пошук** ключове слово, як от "панкейк" для пошуку рецепту панкейок.
`,
  `## Не тримайте все в голові (2)!
адже є ризик забути важливу ціль, ідею чи знання. Натомість одразу фіксуйте це у **strukt**:

**Як зберегти інформацію прямо зараз:**
  * ➕ Натисніть на **«+»** унизу екрану.
  * ✍️ Введіть у текстове поле дані, які потрібно запам'ятати.
  * ✅ Натисніть **«Додати»**.


**Спробуйте прямо зараз! Запишіть ці 5 прикладів, щоб вони завжди були під рукою:**
  * 🥫 **Побутовий лайфхак:** *«Щоб відкрити банку для закрутки, притисніть кришку з боків»*.
  * 🎂 **Важлива дата:** *«Д.Р. [ім'я] [дата народження]»*.
  * 📖 **Цитата або думка:** *«Цікава ідея для проєкту: [текст ідеї]»*.
  * 🛍️ **Список покупок:** *«Купити корм для кота та батарейки»*.
  * ✅ **Ціль:** *«Зробити дз з математики: ст. 12 до 12.11»*

**Як знайти потрібне за секунду:**
  * 🔍 Вам достатньо пам'ятати про наявність, просто введіть у **пошук** ключове слово, як от "панкейк" для пошуку рецепту панкейок.
`,
];
