export const guideMarkdownSteps = [
  // `## 1. Не тримайте все в голові!
  // адже є ризик забути важливу ціль, ідею чи знання. Натомість одразу фіксуйте це у **strukt**:

  // **Як зберегти інформацію прямо зараз:**
  //   * ➕ Натисніть на **«+»**.
  //   * ✍️ Введіть у текстове поле дані, які потрібно запам'ятати.
  //   * ✅ Натисніть **«Додати»**.

  // **Спробуйте прямо зараз!** Збережіть ці приклади, щоб вони завжди були під рукою:
  //   * ✅ **Цілі на сьогодні** "Реалізувати ідею до проекту, купити фрукти та нове крісло."
  //   * 🥫 **лайфхак:** *«Щоб відкрити банку для закрутки, притисніть кришку з боків»*.
  //   * 🛍️ **Ідея до проекту:** «Можливість шукати потрібні елементи пошуком по ключовим словам».
  //   * 🎂 **Важлива дата:** *«Д.Р. [ім'я] [дата народження]»*.
  //   * 📖 **Цікава думка:** «Я немаю вплив на теперішній час, тому що це результат минулого».
  // `,
  // `## 2. Організуйте інформацію, щоб її було легко знайти
  // Коли інформація зберігається неорганізовано та в різних носіях — вона швидко губиться або про неї просто забувають.
  // У **Strukt** вся інформація знаходиться коли потрібно

  // **Як навести порядок у вже збереженій інформації:**
  //   * 📁 Організовуйте записи **як файли на комп’ютері**.
  //   * 🗂️ Об’єднуйте пов’язані елементи у спільні папки.
  //   * 🔗 Поєднуйте папки між собою для створення контексту.

  // **Приклад простої організації:**
  //   * 📚 Створіть елемент **«Домашні завдання»**.
  //   * ✂️ Відкрийте меню потрібного елемента та натисніть **«cut»**.
  //   * 📂 Перейдіть у папку **«Домашні завдання»**.
  //   * 📌 Натисніть **«paste»** внизу екрану.
  //   * 🔙 Натисніть **Root**, щоб повернутися назад і повторити дію з іншими елементами.

  // **Об’єднання папок у більший контекст:**
  //   * 🏫 Створіть папку **«Школа»**.
  //   * 📁 Перемістіть у неї **«Домашні завдання»**, **«Шпаргалки»**, **«Конспекти»**.

  // **Як швидко знайти потрібне:**
  //   * 🧭 Починайте з **Root** і рухайтесь по папках.
  //   * 📂 Папка з вмістом **підсвічується**.
  //   * 📌 Приклад: *Root → Школа → Домашні завдання*.
  // `,
  // `## 3. Замініть десятки інструментів одним підходом
  // Замість різних сервісів для нотаток, планів, календарів і канбану використовуйте один знайомий підхід.

  // **Strukt працює на простій логіці:**
  //   * 🧠 Ви вже вмієте організовувати файли — цього достатньо.
  //   * 📐 Визначте прості правила зберігання.
  //   * 🔁 Один підхід → будь-який тип інформації.

  // **Реальні приклади використання strukt:**

  // **📋 План**
  //   * План — це папка з цілями.
  //   * Кожна ціль може містити підцілі.
  //   * Приклад:
  //     * 📁 **Плани на літо**
  //       * 📁 Прибратися в квартирі
  //         * 🧹 Прибрати спальню
  //         * 🍽️ Прибрати кухню
  //       * 🎂 Зготувати торт
  //       * 🚶 Погуляти з друзями

  // **📌 Канбан**
  //   * Папки — це колонки.
  //   * Елементи — це задачі.
  //   * Просто переміщуйте їх між папками.

  // **📆 Календар**
  //   * 📁 Рік → 📁 Місяць → 📁 День.
  //   * У кожному дні зберігайте цілі, нотатки або досягнення.

  // **📖 Навігація замість змісту**
  //   * Не потрібен окремий «зміст».
  //   * Ви рухаєтесь від **вищого контексту** до деталей, як у файловому менеджері.
  // `,
  `## 1. Не тримайте інформацію в голові. Натомість збережіть її
  Буває різна **корисна** текстова інформація, наприклад: факт, ідея, інструкція, ціль, підказка і тд.
  * **Cтворіть елемент**
    * Нажміть на +
    * Напишіть назву інформації "Ціль: Навчитися використовувати strukt"
    * +Add
    * Таким же чином збережіть наступне:
      * "ідея до проекту: Можливість шукати потрібні елементи пошуком по ключовим словам"
      * "Улюблений трек: Animals"
      * "Комунальні послуги за грудень: e-99kw, t-45m3, w-12m3",

  ## Оптимізуйте пошук - перемістіть інформацію у зрозумілий контекст
  * Зберігаючи інформацію у єдиний список швидко перетвориться на хаос, для цього можна організувати її, прямо як файли на компютері
    * Визначіть, які типи інформації ви скоріше за все зберігатимете рядом (наприклад разом із ідеєю до проекту інші ідеї),
    * Коротко опишіть спільний контекст між ними (наприклад "ідеї до проекту")
    * Створіть папку із назвою контексту "ідеї до проекту"
    * Перемістіть туди вашу інформацію (на елементі ""ідея до проекту"" відкрийте меню та виконайте "cut", потім перейдіть у папку "ідеї до проекту" та натисніть "paste")
    * Повторіть ці кроки для інших елементів ("ідеї_до_проекту/Можливість шукати...", "цілі_на_сьогодні/Навчитися_використовувати_strukt", "комунальні_послуги/грудень_2023")
  * Якщо вже міститься контекст, де ця інформація логічно підходить
    * Перемістіть інформацію туди (наприклад "Ідея використовувати ai для аналізу структури" у "ідеї до проекту")
    * Примітка: Ви можете інтуітивно памятати про наявність повязаної інформації
    * Таким же чином помістіть наступне:
      * "Переглянути гайд по плануванню"
      * "Комуналка за минулий місяць: e-97kw, t-42m3, w-15m3",
      * "Улюблений фільм: Inception"

  * **Багато інформації можна структурувати**, тільки замість відступів - елементи у ієрархії як у змісті. Це допоможе краще орієнтуватися у великій кількості інформації
    * **Порада: Взамємодійте із елементами як файлами на компютері,** тільки у strukt замість файлів текст зберігається прямо в елементі, який дозволяє вкладати в себе дочірні елементи, адже немає обмежень на кількість символів. 
    * Для прикладу збережіть інструкцію по приготуванню панкейок: 
      * створіть елемент з назвою заголовка "рецепт панкейок"
      * перемістіться в нього клікнувши по створеному елементі (зверху **Path** показує ланцюкож папок, у яких находетеся "Root/рецепт_панкейок")
      * Створіть два елементи "інградієнти" та "інструкція", всередині інградієнтів
      * Всередині "Інградієнти" для кожного створіть окремий елемент, наприклад "мука - 200гр", "молоко - 250мл" і тд
      * Перемістіться назад клікнувши на "рецепт панкейок" у **Path**
      * У "інструкція" створіть елементи для кожного кроку приготування
    `,
  `## 2. Оптимізуйте пошук інформації
  * Перемістіть інформацію у зрозумілий контекст
    * Створіть папку із назвою контексту, який би описував інформацію, яку зберігаєте (наприклад: "вивчити strukt" -> "цілі на сьогодні")
    * Перемітіть туди вашу інформацію (на елементі ""вивчити strukt"" відкрийте меню та виконайте "cut", потім перейдіть у папку "цілі на сьогодні" та натисніть "paste")
  * Якщо є повязана інформація
    * Замість створення контексту помістіть в існуючий рядом із повязаною інформацією
    * Примітка: Ви можете інтуітивно памятати про наявність повязаної інформації
    * Наприклад "цілі до проекту" у "проект"
  * Вирішіть як зберігатимете інформацію
    * Бувають випадки, коли вам потрібно не зберігати інформацію і підлаштовуватися під неї, а створити спочатку скелет, на якому ви будете зберігати різноманітну інформацію, наприклад "канбан цілей", "план на майбутнє", "календар успішності", тощо. Для цього не потрібно вивчати безліч спеціалізованих іструментів, натомість можете реалізувати це використовуючи простий інтерфейс провідника файлів
    * Для цього визначіть структуру данних, як саме ви зберігатимете данні
      * Для прикладу канбан - це папки із колонками "todo", "in process", "done", у кожній є папки, що є карточками-цілями, які можна вільно переміщувати. "kanban / todo, in_process, done /"
      * Календар цілей - "Рік/місяць/день/"
      * Глобальний план - "План/ціль/під_ціль/../../"
      * список ідей - "список_ідей/назва_ідеї/опис"
    * І це не межа - текст можна організовувати як завгодно, можете самі придумувати свої правила
  * Якщо інформацію плануєте шукати на пряму (як от номер карточки, паролі чи токен)
    * Залишіть його у Root, для пошуку просто введіть ключове слово використовуючи ункцію "Search"
  * Якщо одна і таж інформація потрібна в двох місцях
    * Виконайте функцію "create link" на елемент, яких хочете щоб був у декілької місцях
    * Створене посилання перемістіть у потрібне вам місце функцією "cut"
  * Якщо у вас немає часу
    * Створіть папку "Тимчасове", у яку зберігатимете інформацію, щоб потім її організувати
`,
  `## 3. Найдіть потрібну вам інформацію
  * Перемістіться у "Root"
  * Найдіть папку, назва якої найбіль відповідає контексту потрібної інформації (використовуйте пошук по ключовим словам якщо елементів багато)
  * Якщо іконка елемента заповнена, одже у нього є вміст і можете його переглянути перемістившись
  * Якщо вміст не підходить, ви можете перейти назад, буде показано з якого елемента ви вийшли, тому навігація буде послідовною
  * Продовжуйте переміщатися в глиб структури доки не найдете необхідну інформацію
  * Або продовжуйте виходити назовні щоб отримати вищий контекст інформації
`,
  `## 4. Оптимізуй роботу із strukt
  В попередніх кроках ви навчилися базовим можливостям, по при це ви можете пришвидшити свій користувацький досвід
  * **Використовуйте AI generation для автоматизації рутинних задач.**
    * AI generation дозволяє редагувати існуючі структури, для цього виконайте "Copy markdown" на елементі, якої вміст хочете оновити, у полі для генерації введіть ваш промпт та вставте зкопійований "markdown", у результаті ви отримаєте оновлену структуру, перевіривши результат можете видалити стару копію, якщо результат невдалий то видаліть нову копію без ризику втратити данні
  * **Використовуйте структуру за межами strukt**
    Ви можете спокійно зкопіювати гілку елементів функцією "Copy markdown" та вставити його у ваш підходящий LLM для аналізу
  * **Використовуйте виключно клавіатурні скорочення** для швидкої взаємодії та повній зосередженості на контенті.
    * For Navigation ↔️
      * "k", "j" - up & down movement
      * "l" - inward movement
      * "h" - outward movement
      * "Shift + h" - movement to the root
    * For Scaling 📈
      * "a" - Add paragraph
      * "g" - Use AI prompt to generate
      * TIP: use "Enter" key after entering text, "Esc" - to cancel
    * For Editing ✏️
      * "e" - Edit folder text
      * "Shift + d" - Remove folder with its content
      * "Shift + j or k" - Change the order of folders
      * "m" - cut folder or paste if already cut
      * "Shift + m" - cancel cutting
    * Other
      * "r" - create link to the selected folder
      * "c" - copy the text of the selected folder
      * "Shift + c" - copy exported markdown of the folders structure
`,
];
